# ColorWithTransparency Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorWithTransparency Constructor
ColorWithTransparency Class See Also
---
color
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ColorWithTransparency()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ColorWithTransparency()
```

# See Also
ColorWithTransparency Class
ColorWithTransparency Overload
Autodesk.Revit.DB Namespace